{
  "app": {
    "name": "SIGNL4",
    "short_description": "Mobile Alerting and Incident Response",
    "long_description": "SIGNL4, Derdack's SaaS solution, re-invents critical alerting, incident response and service dispatching for operating critical infrastructure 24/7. It addresses the needs of people working in areas where swift response matters. SIGNL4 is designed to automate and optimize ticket and incident response and has strong emphasis on mobility.\n\nWhen critical systems fail or incidents happen, SIGNL4 bridges the 'last mile' to your staff, engineers, IT on-call staff and workers 'in the field'. It adds real-time mobile alerting to your Zendesk in no time. SIGNL4 notifies through persistent mobile push, SMS text and voice calls with acknowledgement, tracking and escalation. Integrated duty and shift scheduling ensure the right people are alerted at the right time.\n\nSIGNL4 adds the following to Zendesk:\n\n- Designed for 24/7 operations of critical systems and services\n\n- Provides for high responsiveness in after-business hours support scenarios\n\n- Intuitive mobile app for incident and ticket alerting and response\n\n- Persistent and trackable alert notifications by mobile push, voice calls and text\n\n- Automatically escalates alerts based on target response times\n\n- Scheduled and ad-hoc on-call duty and shift management\n\n- Alert notifications to your entire team or team members on duty\n\n- Custom sounds for your critical alerts on your smartphone\n\n- Monitors, tracks and reports your hours spend on duty\n\n- Complete audit trails of all notifications and response\n\n- And much more\n\nSIGNL4 thus provides for an up to 10x faster and effective response to critical alerts, major incidents, and urgent service requests.\n\nLearn more and sign up for a free trial at [https://www.signl4.com](https://www.signl4.com).",
    "installation_instructions": "1. Get your [SIGNL4](https://www.signl4.com) account.\n\n2. Add the SIGNL4 app from the Zendesk Marketplace.\n\n3. In the configuration add your SIGNL4 team secret.\n\n4. Test the app by creating a new ticket or by sending a manual alert.\n\nThis is it and now your SIGNL4 team will receive alerts whenever a new ticket is created in Zendesk.",
    "parameters": {
      "team_id": {
        "label": "Team Secret",
        "helpText": "Your SIGNL4 team secret. You can use multiple team secrets separated by a semicolon."
      }
    }
  }
}
